Autodesk.Revit.DB.Family.GetFamilyTypeParameterValues(Autodesk.Revit.DB.ElementId)
Returns all applicable values for a FamilyType parameter of this family.
Remarks:
The values are Element Ids of all family types that match
the category specified by the definition of the given parameter.
The elements are either of class Autodesk.Revit.DB.ElementType or
NestedFamilyTypeReference. The second variant is
for the types that are nested in families and thus are not
accessible otherwise.
If there are no applicable types of such category the returned
collection will be empty.
parameterId:
A valid Id of a FamilyType parameter defined for this family.
Returns:
Ids of all applicable Autodesk.Revit.DB.ElementType and NestedFamilyTypeReference elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given parameterId does not represent a valid FamilyType parameter of this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Family.HasStructuralSection
Identifies if this Family can have a structural section.
This property is deprecated in Revit 2016. Use canHaveStructuralSection instead.
Returns:
True if the Family can have structural section, false otherwise.
Since:
2015